/******************************************************************************
Проект:     SDK-2.0 
Название:   Работа с прерываниями
Файл:       interrupt.c
Версия:     1.0.1
******************************************************************************/

#include "lpc2292.h"

void irq_handler( void ) __attribute__ ((interrupt("IRQ")));

///////////////////////////////////////////////////////////////////////////////
// Обработчик прерываний
///////////////////////////////////////////////////////////////////////////////
void irq_handler( void )
{
	void (*interrupt_function)();
  
	interrupt_function = (void(*)())VICVectAddr;
	(*interrupt_function)();
	  
	VICVectAddr = 0; // Clear interrupt in VIC.
}
