/**----------------------------------------------------------------------------
Проект:     SDK-2.0 
Название:   Управление светодиодными индикаторами
Файл:       led.c
Версия:     1.0.4
------------------------------------------------------------------------------*/

#include "lpc2292.h"
#include "led.h"

// Буфер для хранения значения отображаемого на линейке светодиодов
unsigned char ll_buf;


///////////////////////////////////////////////////////////////////////////////
// Инициализация светодиодов
///////////////////////////////////////////////////////////////////////////////
void init_led( void )
{
	init_led_status();
	init_led_line();
}

///////////////////////////////////////////////////////////////////////////////
// Инициализация портов для работы со статусным светодиодом
///////////////////////////////////////////////////////////////////////////////
void init_led_status( void )
{
    IO0DIR |= P_20;
}

///////////////////////////////////////////////////////////////////////////////
// Управление статусным светодиодом
///////////////////////////////////////////////////////////////////////////////
void led_status( unsigned char mode )
{                
    if ( mode == LED_ON )
        IO0SET = P_20;
    else
        IO0CLR = P_20;
}                                

///////////////////////////////////////////////////////////////////////////////
// Инициализация линейки светодиодов
///////////////////////////////////////////////////////////////////////////////
void init_led_line( void )
{
    //Настройка направления выводов порта для светодиодов
    IO2DIR |= P_16 | P_17 | P_18 | P_19 | P_20 | P_21;
}

///////////////////////////////////////////////////////////////////////////////
// Запись, отображаемого на линейке светодиодов значения, в буфер
///////////////////////////////////////////////////////////////////////////////
void led_line( unsigned char light )
{
	ll_buf = light;
}

///////////////////////////////////////////////////////////////////////////////
// Осуществление динамической индикации
///////////////////////////////////////////////////////////////////////////////
void led_line_refresh( void )
{
	static unsigned char state = 1;

	if ( state )
	{
		set_led_line_selection( LL_SEL_01 );
		set_led_line_data( ll_buf );
		state = 0;
	}
	else
	{
		set_led_line_selection( LL_SEL_10 );
		set_led_line_data( ll_buf >> 4 );
		state = 1;
	}
}

///////////////////////////////////////////////////////////////////////////////
// Управление линейкой светодиодов
///////////////////////////////////////////////////////////////////////////////
void set_led_line_selection( unsigned char sel )
{
	switch ( sel )
	{
	case LL_SEL_00: IO2CLR = P_20 | P_21; break;
	case LL_SEL_01: IO2SET = P_20; IO2CLR = P_21; break;
	case LL_SEL_10: IO2CLR = P_20; IO2SET = P_21; break;
	case LL_SEL_11: IO2SET = P_20 | P_21; break;
	}
}

///////////////////////////////////////////////////////////////////////////////
// Управление линейкой светодиодов
///////////////////////////////////////////////////////////////////////////////
void set_led_line_data( unsigned char light )
{
	IO2CLR = 0x000F0000;
	IO2SET = ( light & 0x0F ) << 16;
}
